[NoCoverage] Block removal mutation
Infra.MongoDB/Commons/Connection/ConnectionFactory.cs:10:5
     private readonly string _connectionString;
 
     public ConnectionFactory(string connectionString)
-    {
-        _connectionString = connectionString;
-    }
+    {}
 
     public IMongoClient GetClient()

[NoCoverage] Block removal mutation
Infra.MongoDB/Commons/Connection/ConnectionFactory.cs:15:5
     }
 
     public IMongoClient GetClient()
-    {
-        MongoClientSettings settings = MongoClientSettings.FromUrl(new MongoUrl(_connectionString));
-
-        return new MongoClient(settings);
-    }
+    {}
 
     public IMongoDatabase GetDatabase(string databaseName)

[NoCoverage] Block removal mutation
Infra.MongoDB/Commons/Connection/ConnectionFactory.cs:22:5
     }
 
     public IMongoDatabase GetDatabase(string databaseName)
-    {
-        IMongoClient mongoDbClient = GetClient();
-
-        return mongoDbClient.GetDatabase(databaseName);
-    }
+    {}
 }
