[NoCoverage] String mutation
Infra.MongoDB/Commons/Extensions/MongoCollectionQueryByPageExtensions.cs:19:92
         int pageNumber,
         int pageSize)
     {
-        AggregateFacet<TDocument, AggregateCountResult> countFacet = AggregateFacet.Create("count",
+        AggregateFacet<TDocument, AggregateCountResult> countFacet = AggregateFacet.Create("",
             PipelineDefinition<TDocument, AggregateCountResult>.Create(new[]
             {

[NoCoverage] Arithmetic mutation
Infra.MongoDB/Commons/Extensions/MongoCollectionQueryByPageExtensions.cs:29:64
             PipelineDefinition<TDocument, TDocument>.Create(new[]
             {
                 PipelineStageDefinitionBuilder.Sort(sortDefinition),
-                PipelineStageDefinitionBuilder.Skip<TDocument>(pageNumber * pageSize),
+                PipelineStageDefinitionBuilder.Skip<TDocument>(pageNumber / pageSize),
                 PipelineStageDefinitionBuilder.Limit<TDocument>(pageSize)
             }));

[NoCoverage] Arithmetic mutation
Infra.MongoDB/Commons/Extensions/MongoCollectionQueryByPageExtensions.cs:40:45
 
         long totalOfElements = GetTotalOfElements(aggregation);
 
-        int totalPages = (int) Math.Ceiling((float) totalOfElements / pageSize);
+        int totalPages = (int) Math.Ceiling((float) totalOfElements * pageSize);
 
         IReadOnlyList<TDocument> content = aggregation.FirstOrDefault()!

[NoCoverage] Conditional (false) mutation
Infra.MongoDB/Commons/Extensions/MongoCollectionQueryByPageExtensions.cs:52:16
     private static long GetTotalOfElements(IReadOnlyList<AggregateFacetResults> aggregation)
     {
         AggregateFacetResult? aggregateFacetResult = aggregation[0].Facets.FirstOrDefault(element => element.Name == "count");
-        return aggregateFacetResult is not null && aggregateFacetResult.Output<AggregateCountResult>().Count != 0
-            ? aggregateFacetResult.Output<AggregateCountResult>()[0].Count
-            : 0;
+        return (false?aggregateFacetResult.Output<AggregateCountResult>()[0].Count
+:0);
     }
 }

[NoCoverage] Equality mutation
Infra.MongoDB/Commons/Extensions/MongoCollectionQueryByPageExtensions.cs:52:16
     private static long GetTotalOfElements(IReadOnlyList<AggregateFacetResults> aggregation)
     {
         AggregateFacetResult? aggregateFacetResult = aggregation[0].Facets.FirstOrDefault(element => element.Name == "count");
-        return aggregateFacetResult is not null && aggregateFacetResult.Output<AggregateCountResult>().Count != 0
+        return aggregateFacetResult is null && aggregateFacetResult.Output<AggregateCountResult>().Count != 0
             ? aggregateFacetResult.Output<AggregateCountResult>()[0].Count
             : 0;
