[Killed] Statement mutation
Infra.MongoDB/Commons/Helpers/FilterHelper.cs:13:25
 {
     public static void AddEqualsFilter<T>(ICollection<FilterDefinition<T>> definitions, Expression<Func<T, object>> expression, int value)
     {
-        if (value == 0) return;
+        if (value == 0) ;
         definitions.Add(Builders<T>.Filter.Eq(expression, value));
     }
killedBy: IntegrationTest.Infra.MongoDB.Commons.FilterDefinitionHelperTest.FailToAddFilterDefinitionIfValueIsNotRelevant

[Killed] Equality mutation
Infra.MongoDB/Commons/Helpers/FilterHelper.cs:13:13
 {
     public static void AddEqualsFilter<T>(ICollection<FilterDefinition<T>> definitions, Expression<Func<T, object>> expression, int value)
     {
-        if (value == 0) return;
+        if (value != 0) return;
         definitions.Add(Builders<T>.Filter.Eq(expression, value));
     }
killedBy: IntegrationTest.Infra.MongoDB.Commons.FilterDefinitionHelperTest.SuccessfulToAddFilterDefinitionIfValueIsNotNull; IntegrationTest.Infra.MongoDB.Commons.FilterDefinitionHelperTest.FailToAddFilterDefinitionIfValueIsNotRelevant

[Killed] Statement mutation
Infra.MongoDB/Commons/Helpers/FilterHelper.cs:14:9
     public static void AddEqualsFilter<T>(ICollection<FilterDefinition<T>> definitions, Expression<Func<T, object>> expression, int value)
     {
         if (value == 0) return;
-        definitions.Add(Builders<T>.Filter.Eq(expression, value));
+        ;
     }
 
killedBy: IntegrationTest.Infra.MongoDB.Commons.FilterDefinitionHelperTest.SuccessfulToAddFilterDefinitionIfValueIsNotNull

[Killed] Negate expression
Infra.MongoDB/Commons/Helpers/FilterHelper.cs:19:13
 
     public static void AddEqualsFilter<T>(ICollection<FilterDefinition<T>> filterDefinitions, Expression<Func<T, object>> expression, string value)
     {
-        if (string.IsNullOrEmpty(value)) return;
+        if (!(string.IsNullOrEmpty(value))) return;
         filterDefinitions.Add(Builders<T>.Filter.Eq(expression, value));
     }
killedBy: IntegrationTest.Infra.MongoDB.Commons.FilterDefinitionHelperTest.SuccessfulToAddFilterDefinitionIfValueIsNotNull; IntegrationTest.Infra.MongoDB.Commons.FilterDefinitionHelperTest.FailToAddFilterDefinitionIfValueIsNull

[Killed] Statement mutation
Infra.MongoDB/Commons/Helpers/FilterHelper.cs:19:42
 
     public static void AddEqualsFilter<T>(ICollection<FilterDefinition<T>> filterDefinitions, Expression<Func<T, object>> expression, string value)
     {
-        if (string.IsNullOrEmpty(value)) return;
+        if (string.IsNullOrEmpty(value)) ;
         filterDefinitions.Add(Builders<T>.Filter.Eq(expression, value));
     }
killedBy: IntegrationTest.Infra.MongoDB.Commons.FilterDefinitionHelperTest.FailToAddFilterDefinitionIfValueIsNull

[Killed] Statement mutation
Infra.MongoDB/Commons/Helpers/FilterHelper.cs:20:9
     public static void AddEqualsFilter<T>(ICollection<FilterDefinition<T>> filterDefinitions, Expression<Func<T, object>> expression, string value)
     {
         if (string.IsNullOrEmpty(value)) return;
-        filterDefinitions.Add(Builders<T>.Filter.Eq(expression, value));
+        ;
     }
 
killedBy: IntegrationTest.Infra.MongoDB.Commons.FilterDefinitionHelperTest.SuccessfulToAddFilterDefinitionIfValueIsNotNull

[Killed] Statement mutation
Infra.MongoDB/Commons/Helpers/FilterHelper.cs:26:9
     public static void AddLikeFilter<T>(ICollection<FilterDefinition<T>> filterDefinitions, Expression<Func<T, object>> expression, string value)
     {
         if (string.IsNullOrEmpty(value)) return;
-        filterDefinitions.Add(Builders<T>.Filter.Regex(expression, value));
+        ;
     }
 
killedBy: IntegrationTest.Infra.MongoDB.Commons.FilterDefinitionHelperTest.SuccessfulToAddFilterDefinitionIfValueIsNotNull

[Killed] Statement mutation
Infra.MongoDB/Commons/Helpers/FilterHelper.cs:33:9
     {
         if (string.IsNullOrEmpty(value)) return;
         DateTime dateTime = DateTime.Parse(value, CultureInfo.DefaultThreadCurrentCulture).ToUniversalTime();
-        definitions.Add(Builders<T>.Filter.Gte(expression, dateTime));
+        ;
     }
 
killedBy: IntegrationTest.Infra.MongoDB.Commons.FilterDefinitionHelperTest.SuccessfulToAddFilterDefinitionIfValueIsNotNull

[Killed] Statement mutation
Infra.MongoDB/Commons/Helpers/FilterHelper.cs:40:9
     {
         if (string.IsNullOrEmpty(value)) return;
         DateTime dateTime = DateTime.Parse(value, CultureInfo.DefaultThreadCurrentCulture).ToUniversalTime();
-        filterDefinitions.Add(Builders<T>.Filter.Lte(expression, dateTime));
+        ;
     }
 
killedBy: IntegrationTest.Infra.MongoDB.Commons.FilterDefinitionHelperTest.SuccessfulToAddFilterDefinitionIfValueIsNotNull

[Killed] Negate expression
Infra.MongoDB/Commons/Helpers/FilterHelper.cs:46:13
     public static void AddGreaterOrEqualFilter<T>(List<FilterDefinition<T>> filterDefinitions, Expression<Func<T, object>> expression, float value)
     {
         const float epsilon = 0.0001f; 
-        if (value < epsilon) return;
+        if (!(value < epsilon)) return;
         filterDefinitions.Add(Builders<T>.Filter.Gte(expression, value));
     }
killedBy: IntegrationTest.Infra.MongoDB.Commons.FilterDefinitionHelperTest.FailToAddFilterDefinitionIfValueIsNotRelevant

[Killed] Equality mutation
Infra.MongoDB/Commons/Helpers/FilterHelper.cs:46:13
     public static void AddGreaterOrEqualFilter<T>(List<FilterDefinition<T>> filterDefinitions, Expression<Func<T, object>> expression, float value)
     {
         const float epsilon = 0.0001f; 
-        if (value < epsilon) return;
+        if (value > epsilon) return;
         filterDefinitions.Add(Builders<T>.Filter.Gte(expression, value));
     }
killedBy: IntegrationTest.Infra.MongoDB.Commons.FilterDefinitionHelperTest.FailToAddFilterDefinitionIfValueIsNotRelevant

[NoCoverage] Statement mutation
Infra.MongoDB/Commons/Helpers/FilterHelper.cs:47:9
     {
         const float epsilon = 0.0001f; 
         if (value < epsilon) return;
-        filterDefinitions.Add(Builders<T>.Filter.Gte(expression, value));
+        ;
     }
 

[Killed] Statement mutation
Infra.MongoDB/Commons/Helpers/FilterHelper.cs:53:30
     public static void AddLessOrEqualFilter<T>(List<FilterDefinition<T>> filterDefinitions, Expression<Func<T, object>> expression, float value)
     {
         const float epsilon = 0.0001f; 
-        if (value < epsilon) return;
+        if (value < epsilon) ;
         filterDefinitions.Add(Builders<T>.Filter.Lte(expression, value));
     }
killedBy: IntegrationTest.Infra.MongoDB.Commons.FilterDefinitionHelperTest.FailToAddFilterDefinitionIfValueIsNotRelevant

[NoCoverage] Statement mutation
Infra.MongoDB/Commons/Helpers/FilterHelper.cs:54:9
     {
         const float epsilon = 0.0001f; 
         if (value < epsilon) return;
-        filterDefinitions.Add(Builders<T>.Filter.Lte(expression, value));
+        ;
     }
 

[Killed] Negate expression
Infra.MongoDB/Commons/Helpers/FilterHelper.cs:59:13
 
     public static void AddInArrayFilter<T>(List<FilterDefinition<T>> filterDefinitions, Expression<Func<T, object>> expression, List<string> values)
     {
-        if (values == null || values.Count == 0) return;
+        if (!(values == null || values.Count == 0)) return;
         filterDefinitions.Add(Builders<T>.Filter.In(expression, values));
     }
killedBy: IntegrationTest.Infra.MongoDB.Commons.FilterDefinitionHelperTest.FailToAddFilterDefinitionIfValueIsNotRelevant

[Killed] Equality mutation
Infra.MongoDB/Commons/Helpers/FilterHelper.cs:59:31
 
     public static void AddInArrayFilter<T>(List<FilterDefinition<T>> filterDefinitions, Expression<Func<T, object>> expression, List<string> values)
     {
-        if (values == null || values.Count == 0) return;
+        if (values == null || values.Count != 0) return;
         filterDefinitions.Add(Builders<T>.Filter.In(expression, values));
     }
killedBy: IntegrationTest.Infra.MongoDB.Commons.FilterDefinitionHelperTest.FailToAddFilterDefinitionIfValueIsNotRelevant

[NoCoverage] Statement mutation
Infra.MongoDB/Commons/Helpers/FilterHelper.cs:60:9
     public static void AddInArrayFilter<T>(List<FilterDefinition<T>> filterDefinitions, Expression<Func<T, object>> expression, List<string> values)
     {
         if (values == null || values.Count == 0) return;
-        filterDefinitions.Add(Builders<T>.Filter.In(expression, values));
+        ;
     }
 }
