[Killed] Statement mutation
Infra.MongoDB/Commons/Helpers/UpdateHelper.cs:17:78
         T newValue
     )
     {
-        if (currentValue is not null && CompareItem(currentValue, newValue)) return;
+        if (currentValue is not null && CompareItem(currentValue, newValue)) ;
         definitions.Add(Builders<TU>.Update.Set(fieldName, newValue));
     }
killedBy: IntegrationTest.Infra.MongoDB.Commons.UpdateDefinitionHelperTest.FailToAddUpDefinitionIfValueHasNotChanged

[Killed] Negate expression
Infra.MongoDB/Commons/Helpers/UpdateHelper.cs:17:13
         T newValue
     )
     {
-        if (currentValue is not null && CompareItem(currentValue, newValue)) return;
+        if (!(currentValue is not null && CompareItem(currentValue, newValue))) return;
         definitions.Add(Builders<TU>.Update.Set(fieldName, newValue));
     }
killedBy: IntegrationTest.Infra.MongoDB.Commons.UpdateDefinitionHelperTest.SuccessfulToAddUpDefinitionIfValueIsNull; IntegrationTest.Infra.MongoDB.Commons.UpdateDefinitionHelperTest.FailToAddUpDefinitionIfValueHasNotChanged; IntegrationTest.Infra.MongoDB.Commons.UpdateDefinitionHelperTest.SuccessfulToAddUpDefinitionIfValueHasChanged

[Killed] Statement mutation
Infra.MongoDB/Commons/Helpers/UpdateHelper.cs:18:9
     )
     {
         if (currentValue is not null && CompareItem(currentValue, newValue)) return;
-        definitions.Add(Builders<TU>.Update.Set(fieldName, newValue));
+        ;
     }
 
killedBy: IntegrationTest.Infra.MongoDB.Commons.UpdateDefinitionHelperTest.SuccessfulToAddUpDefinitionIfValueIsNull; IntegrationTest.Infra.MongoDB.Commons.UpdateDefinitionHelperTest.SuccessfulToAddUpDefinitionIfValueHasChanged; IntegrationTest.Infra.MongoDB.Commons.UpdateDefinitionHelperTest.SuccessfulToAddUpDefinitionIfValueWasNull

[Killed] Statement mutation
Infra.MongoDB/Commons/Helpers/UpdateHelper.cs:29:50
         List<T> newValue
     )
     {
-        if (CompareList(currentValue, newValue)) return;
+        if (CompareList(currentValue, newValue)) ;
         definitions.Add(Builders<TU>.Update.Set(fieldName, newValue));
     }
killedBy: IntegrationTest.Infra.MongoDB.Commons.UpdateDefinitionHelperTest.FailToAddMultipleUpDefinitionsIfValueHasNotChanged; IntegrationTest.Infra.MongoDB.Commons.UpdateDefinitionHelperTest.FailToAddMultipleUpDefinitionsIfValuesAreNull

[Killed] Negate expression
Infra.MongoDB/Commons/Helpers/UpdateHelper.cs:29:13
         List<T> newValue
     )
     {
-        if (CompareList(currentValue, newValue)) return;
+        if (!(CompareList(currentValue, newValue))) return;
         definitions.Add(Builders<TU>.Update.Set(fieldName, newValue));
     }
killedBy: IntegrationTest.Infra.MongoDB.Commons.UpdateDefinitionHelperTest.SuccessfulToAddMultipleUpDefinitionsIfValueHasChanged; IntegrationTest.Infra.MongoDB.Commons.UpdateDefinitionHelperTest.SuccessfulToAddMultipleUpDefinitionsIfCurrentValueIsNull; IntegrationTest.Infra.MongoDB.Commons.UpdateDefinitionHelperTest.FailToAddMultipleUpDefinitionsIfValueHasNotChanged

[Killed] Statement mutation
Infra.MongoDB/Commons/Helpers/UpdateHelper.cs:30:9
     )
     {
         if (CompareList(currentValue, newValue)) return;
-        definitions.Add(Builders<TU>.Update.Set(fieldName, newValue));
+        ;
     }
 
killedBy: IntegrationTest.Infra.MongoDB.Commons.UpdateDefinitionHelperTest.SuccessfulToAddMultipleUpDefinitionsIfValueHasChanged; IntegrationTest.Infra.MongoDB.Commons.UpdateDefinitionHelperTest.SuccessfulToAddMultipleUpDefinitionsIfCurrentValueIsNull; IntegrationTest.Infra.MongoDB.Commons.UpdateDefinitionHelperTest.SuccessfulToAddMultipleUpDefinitionsIfNewValueIsNull

[Killed] Block removal mutation
Infra.MongoDB/Commons/Helpers/UpdateHelper.cs:34:5
     }
 
     private static bool CompareItem<T>(T first, T second)
-    {
-        return EqualityComparer<T>.Default.Equals(first, second);
-    }
+    {}
 
     private static bool CompareList<T>(List<T> first, List<T> second)
killedBy: IntegrationTest.Infra.MongoDB.Commons.UpdateDefinitionHelperTest.FailToAddUpDefinitionIfValueHasNotChanged

[Killed] Negate expression
Infra.MongoDB/Commons/Helpers/UpdateHelper.cs:40:13
 
     private static bool CompareList<T>(List<T> first, List<T> second)
     {
-        if (first is null && second is null) return true;
+        if (!(first is null && second is null)) return true;
         if (first is null || second is null) return false;
 
killedBy: IntegrationTest.Infra.MongoDB.Commons.UpdateDefinitionHelperTest.SuccessfulToAddMultipleUpDefinitionsIfValueHasChanged; IntegrationTest.Infra.MongoDB.Commons.UpdateDefinitionHelperTest.SuccessfulToAddMultipleUpDefinitionsIfCurrentValueIsNull; IntegrationTest.Infra.MongoDB.Commons.UpdateDefinitionHelperTest.FailToAddMultipleUpDefinitionsIfValuesAreNull

[Killed] Logical mutation
Infra.MongoDB/Commons/Helpers/UpdateHelper.cs:40:13
 
     private static bool CompareList<T>(List<T> first, List<T> second)
     {
-        if (first is null && second is null) return true;
+        if (first is null || second is null) return true;
         if (first is null || second is null) return false;
 
killedBy: IntegrationTest.Infra.MongoDB.Commons.UpdateDefinitionHelperTest.SuccessfulToAddMultipleUpDefinitionsIfCurrentValueIsNull; IntegrationTest.Infra.MongoDB.Commons.UpdateDefinitionHelperTest.SuccessfulToAddMultipleUpDefinitionsIfNewValueIsNull

[Killed] Equality mutation
Infra.MongoDB/Commons/Helpers/UpdateHelper.cs:41:30
     private static bool CompareList<T>(List<T> first, List<T> second)
     {
         if (first is null && second is null) return true;
-        if (first is null || second is null) return false;
+        if (first is null || second is not null) return false;
 
         return !first.Except(second).Any() && !second.Except(first).Any();
killedBy: IntegrationTest.Infra.MongoDB.Commons.UpdateDefinitionHelperTest.FailToAddMultipleUpDefinitionsIfValueHasNotChanged; IntegrationTest.Infra.MongoDB.Commons.UpdateDefinitionHelperTest.SuccessfulToAddMultipleUpDefinitionsIfNewValueIsNull

[Killed] Boolean mutation
Infra.MongoDB/Commons/Helpers/UpdateHelper.cs:41:53
     private static bool CompareList<T>(List<T> first, List<T> second)
     {
         if (first is null && second is null) return true;
-        if (first is null || second is null) return false;
+        if (first is null || second is null) return true;
 
         return !first.Except(second).Any() && !second.Except(first).Any();
killedBy: IntegrationTest.Infra.MongoDB.Commons.UpdateDefinitionHelperTest.SuccessfulToAddMultipleUpDefinitionsIfCurrentValueIsNull; IntegrationTest.Infra.MongoDB.Commons.UpdateDefinitionHelperTest.SuccessfulToAddMultipleUpDefinitionsIfNewValueIsNull

[Killed] Linq method mutation (Except() to Concat())
Infra.MongoDB/Commons/Helpers/UpdateHelper.cs:43:17
         if (first is null && second is null) return true;
         if (first is null || second is null) return false;
 
-        return !first.Except(second).Any() && !second.Except(first).Any();
+        return !first.Concat(second).Any() && !second.Except(first).Any();
     }
 }
killedBy: IntegrationTest.Infra.MongoDB.Commons.UpdateDefinitionHelperTest.FailToAddMultipleUpDefinitionsIfValueHasNotChanged

[Killed] LogicalNotExpression to un-LogicalNotExpression mutation
Infra.MongoDB/Commons/Helpers/UpdateHelper.cs:43:16
         if (first is null && second is null) return true;
         if (first is null || second is null) return false;
 
-        return !first.Except(second).Any() && !second.Except(first).Any();
+        return first.Except(second).Any() && !second.Except(first).Any();
     }
 }
killedBy: IntegrationTest.Infra.MongoDB.Commons.UpdateDefinitionHelperTest.FailToAddMultipleUpDefinitionsIfValueHasNotChanged
